/**********************************************
 *	Дан код:                                  *
 *	var a = 1, b = 1, c, d;                   *
 *	c = ++a; alert(c);           // 2     A   *
 *	d = b++; alert(d);           // 1     B   *
 *  c = (2+ ++a); alert(c);      // 5     C   *
 *	d = (2+ b++); alert(d);      // 4     D   *
 *	alert(a);                    // 3     E   *
 *	alert(b);                    // 3     F   *
 *                                            *
 *	Почему код даёт именно такие результаты?  *
 **********************************************/
 
var a = 1, b = 1, c, d;
c = ++a; alert(c);           // 2
d = b++; alert(d);           // 1
c = (2+ ++a); alert(c);      // 5
d = (2+ b++); alert(d);      // 4
alert(a);                    // 3
alert(b);                    // 3


/*