/****************************************************************************************
 * Реализовать основные 4 арифметические операции в виде функций с двумя параметрами.   *
 * Обязательно использовать оператор return.                                            *
 ****************************************************************************************/
 
 // сложение
function addition(a = 10, b = 5){
	return 'Резултат сложения введенных параметров ' + (a + b) + '.';	
 } 
 
 // вычитание
 function subtraction(a = 10, b = 5){
	return 'Резултат вычитания введенных параметров ' + (a - b) + '.';
 }
 
 // умножение
 function mult (a = 10,  b = 5) {
	return 'Резултат умножения введенных параметров ' + (a * b) + '.'; 
 }
 
 // деление
 function division (a = 10, b = 5) {
	 return 'Резултат деления введенных параметров ' + (a / b) + '.';
 }
 
 console.log(addition());
 console.log(subtraction());
 console.log(mult());
 console.log(division());