/***************************************************
 * Задача 2.                                       *
 * Работа с переменными.                           *
 * Объявить две переменные: admin и name.      A   *
 * Записать в name строку "Василий";           B   *
 * Скопировать значение из name в admin.       C   *
 * Вывести admin (должно вывести «Василий»).   D   *
 ***************************************************/

// A - объявляю переменные admin и name
let admin;
let name;

// B - записываю в name строковое значение "Василий"
name = 'Василий';

// C - копирую значение из name в admin;
admin = name;

// D - вывожу admin. использую alert.
alert(admin);
